; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v6 - type_3 ?v5 - type_1)
 	      (pred_2 ?v7 - object ?v5 - type_1)
	      (pred_1 ?v6 - type_3 ?v2 - type_2)
	      (pred_3 ?v6 - type_3 ?v7 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v6 - type_3 ?v3 ?v4 - type_1)
       :precondition (and  (pred_4 ?v6 ?v3))
       :effect (and  (pred_4 ?v6 ?v4)
		     (not (pred_4 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_3 ?v8 - object ?v1 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v1) (pred_4 ?v6 ?v1) (pred_1 ?v6 ?v2))
       :effect (and (pred_3 ?v6 ?v8 ?v2)
		    (not (pred_2 ?v8 ?v1)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_3 ?v8 - object ?v1 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v8 ?v2) (pred_4 ?v6 ?v1))
       :effect (and (pred_2 ?v8 ?v1)
		    (pred_1 ?v6 ?v2)
		    (not (pred_3 ?v6 ?v8 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_08 obj_09 - type_2
obj_06 obj_07 obj_02 - type_1
obj_05 obj_04 obj_01 - object)
(:init
(pred_4 obj_03 obj_07)
(pred_1 obj_03 obj_08)
(pred_1 obj_03 obj_09)
(pred_2 obj_05 obj_07)
(pred_2 obj_04 obj_07)
(pred_2 obj_01 obj_06)
)
(:goal
(and
(pred_2 obj_05 obj_06)
(pred_2 obj_04 obj_07)
(pred_2 obj_01 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_08))))
)
)

; plan
1. (op_1 obj_03 obj_05 obj_07 obj_09)
   deleted: (pred_2 obj_05 obj_07) (pred_1 obj_03 obj_09)
   added: (pred_3 obj_03 obj_05 obj_09)
   goals met: 1 of 3
2. (op_2 obj_03 obj_07 obj_06)
   deleted: (pred_4 obj_03 obj_07)
   added: (pred_4 obj_03 obj_06)
   goals met: 1 of 3
3. (op_3 obj_03 obj_05 obj_06 obj_09)
   deleted: (pred_3 obj_03 obj_05 obj_09)
   added: (pred_2 obj_05 obj_06) (pred_1 obj_03 obj_09)
   goals met: 2 of 3
4. (op_1 obj_03 obj_01 obj_06 obj_09)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_03 obj_09)
   added: (pred_3 obj_03 obj_01 obj_09)
   goals met: 2 of 3
5. (op_2 obj_03 obj_06 obj_02)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_02)
   goals met: 2 of 3
6. (op_3 obj_03 obj_01 obj_02 obj_09)
   deleted: (pred_3 obj_03 obj_01 obj_09)
   added: (pred_2 obj_01 obj_02) (pred_1 obj_03 obj_09)
   goals met: 3 of 3
